Tekla.Structures.Model.BaseWeld.WeldProcessTypeEnum
The weld process type.

Tekla.Structures.Model.BaseWeld.WeldProcessTypeEnum.WELD_PROCESS_NONE
No process type.

Tekla.Structures.Model.BaseWeld.WeldProcessTypeEnum.WELD_PROCESS_SMAW
The shielded metal arc (SMAW) process type.

Tekla.Structures.Model.BaseWeld.WeldProcessTypeEnum.WELD_PROCESS_SAW
The submerged arc (SAW) process type.

Tekla.Structures.Model.BaseWeld.WeldProcessTypeEnum.WELD_PROCESS_GMAW
The gas metal arc (GMAW) process type.

Tekla.Structures.Model.BaseWeld.WeldProcessTypeEnum.WELD_PROCESS_FCAW
The flux cored arc (FCAW) process type.

Tekla.Structures.Model.BaseWeld.WeldProcessTypeEnum.WELD_PROCESS_ESW
The electroslag (ESW) process type.

Tekla.Structures.Model.BaseWeld.WeldProcessTypeEnum.WELD_PROCESS_EGW
The electrogas (EGW) process type.